t0biasm/embedded-project/platforms/c2000/mcal/f28p65/code/inc/hw_usb.h
//###########################################################################
//
// FILE:    hw_usb.h
//
// TITLE:   Definitions for the USB registers.
//
//###########################################################################
// 
// C2000Ware v6.00.00.00
//
// Copyright (C) 2024 Texas Instruments Incorporated - http://www.ti.com
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//###########################################################################

#ifndef HW_USB_H
#define HW_USB_H

//*****************************************************************************
//
// The following are defines for the Univeral Serial Bus register offsets.
//
//*****************************************************************************
#define USB_O_FADDR             0x00000000U  // USB Device Functional Address
#define USB_O_POWER             0x00000001U  // USB Power
#define USB_O_TXIS              0x00000002U  // USB Transmit Interrupt Status
#define USB_O_RXIS              0x00000004U  // USB Receive Interrupt Status
#define USB_O_TXIE              0x00000006U  // USB Transmit Interrupt Enable
#define USB_O_RXIE              0x00000008U  // USB Receive Interrupt Enable
#define USB_O_IS                0x0000000AU  // USB General Interrupt Status
#define USB_O_IE                0x0000000BU  // USB Interrupt Enable
#define USB_O_FRAME             0x0000000CU  // USB Frame Value
#define USB_O_EPIDX             0x0000000EU  // USB Endpoint Index
#define USB_O_TEST              0x0000000FU  // USB Test Mode
#define USB_O_FIFO0             0x00000020U  // USB FIFO Endpoint 0
#define USB_O_FIFO1             0x00000024U  // USB FIFO Endpoint 1
#define USB_O_FIFO2             0x00000028U  // USB FIFO Endpoint 2
#define USB_O_FIFO3             0x0000002CU  // USB FIFO Endpoint 3
#define USB_O_FIFO4             0x00000030U  // USB FIFO Endpoint 4
#define USB_O_FIFO5             0x00000034U  // USB FIFO Endpoint 5
#define USB_O_FIFO6             0x00000038U  // USB FIFO Endpoint 6
#define USB_O_FIFO7             0x0000003CU  // USB FIFO Endpoint 7
#define USB_O_FIFO8             0x00000040U  // USB FIFO Endpoint 8
#define USB_O_FIFO9             0x00000044U  // USB FIFO Endpoint 9
#define USB_O_FIFO10            0x00000048U  // USB FIFO Endpoint 10
#define USB_O_FIFO11            0x0000004CU  // USB FIFO Endpoint 11
#define USB_O_FIFO12            0x00000050U  // USB FIFO Endpoint 12
#define USB_O_FIFO13            0x00000054U  // USB FIFO Endpoint 13
#define USB_O_FIFO14            0x00000058U  // USB FIFO Endpoint 14
#define USB_O_FIFO15            0x0000005CU  // USB FIFO Endpoint 15
#define USB_O_DEVCTL            0x00000060U  // USB Device Control
#define USB_O_TXFIFOSZ          0x00000062U  // USB Transmit Dynamic FIFO Sizing
#define USB_O_RXFIFOSZ          0x00000063U  // USB Receive Dynamic FIFO Sizing
#define USB_O_TXFIFOADD         0x00000064U  // USB Transmit FIFO Start Address
#define USB_O_RXFIFOADD         0x00000066U  // USB Receive FIFO Start Address
#define USB_O_CONTIM            0x0000007AU  // USB Connect Timing
#define USB_O_VPLEN             0x0000007BU  // USB OTG VBUS Pulse Timing
#define USB_O_FSEOF             0x0000007DU  // USB Full-Speed Last Transaction
                                             // to End of Frame Timing
#define USB_O_LSEOF             0x0000007EU  // USB Low-Speed Last Transaction
                                             // to End of Frame Timing
#define USB_O_TXFUNCADDR0       0x00000080U  // USB Transmit Functional Address
                                             // Endpoint 0
#define USB_O_TXHUBADDR0        0x00000082U  // USB Transmit Hub Address
                                             // Endpoint 0
#define USB_O_TXHUBPORT0        0x00000083U  // USB Transmit Hub Port Endpoint 0
#define USB_O_TXFUNCADDR1       0x00000088U  // USB Transmit Functional Address
                                             // Endpoint 1
#define USB_O_TXHUBADDR1        0x0000008AU  // USB Transmit Hub Address
                                             // Endpoint 1
#define USB_O_TXHUBPORT1        0x0000008BU  // USB Transmit Hub Port Endpoint 1
#define USB_O_RXFUNCADDR1       0x0000008CU  // USB Receive Functional Address
                                             // Endpoint 1
#define USB_O_RXHUBADDR1        0x0000008EU  // USB Receive Hub Address Endpoint
                                             // 1
#define USB_O_RXHUBPORT1        0x0000008FU  // USB Receive Hub Port Endpoint 1
#define USB_O_TXFUNCADDR2       0x00000090U  // USB Transmit Functional Address
                                             // Endpoint 2
#define USB_O_TXHUBADDR2        0x00000092U  // USB Transmit Hub Address
                                             // Endpoint 2
#define USB_O_TXHUBPORT2        0x00000093U  // USB Transmit Hub Port Endpoint 2
#define USB_O_RXFUNCADDR2       0x00000094U  // USB Receive Functional Address
                                             // Endpoint 2
#define USB_O_RXHUBADDR2        0x00000096U  // USB Receive Hub Address Endpoint
                                             // 2
#define USB_O_RXHUBPORT2        0x00000097U  // USB Receive Hub Port Endpoint 2
#define USB_O_TXFUNCADDR3       0x00000098U  // USB Transmit Functional Address
                                             // Endpoint 3
#define USB_O_TXHUBADDR3        0x0000009AU  // USB Transmit Hub Address
                                             // Endpoint 3
#define USB_O_TXHUBPORT3        0x0000009BU  // USB Transmit Hub Port Endpoint 3
#define USB_O_RXFUNCADDR3       0x0000009CU  // USB Receive Functional Address
                                             // Endpoint 3
#define USB_O_RXHUBADDR3        0x0000009EU  // USB Receive Hub Address Endpoint
                                             // 3
#define USB_O_RXHUBPORT3        0x0000009FU  // USB Receive Hub Port Endpoint 3
#define USB_O_TXFUNCADDR4       0x000000A0U  // USB Transmit Functional Address
                                             // Endpoint 4
#define USB_O_TXHUBADDR4        0x000000A2U  // USB Transmit Hub Address
                                             // Endpoint 4
#define USB_O_TXHUBPORT4        0x000000A3U  // USB Transmit Hub Port Endpoint 4
#define USB_O_RXFUNCADDR4       0x000000A4U  // USB Receive Functional Address
                                             // Endpoint 4
#define USB_O_RXHUBADDR4        0x000000A6U  // USB Receive Hub Address Endpoint
                                             // 4
#define USB_O_RXHUBPORT4        0x000000A7U  // USB Receive Hub Port Endpoint 4
#define USB_O_TXFUNCADDR5       0x000000A8U  // USB Transmit Functional Address
                                             // Endpoint 5
#define USB_O_TXHUBADDR5        0x000000AAU  // USB Transmit Hub Address
                                             // Endpoint 5
#define USB_O_TXHUBPORT5        0x000000ABU  // USB Transmit Hub Port Endpoint 5
#define USB_O_RXFUNCADDR5       0x000000ACU  // USB Receive Functional Address
                                             // Endpoint 5
#define USB_O_RXHUBADDR5        0x000000AEU  // USB Receive Hub Address Endpoint
                                             // 5
#define USB_O_RXHUBPORT5        0x000000AFU  // USB Receive Hub Port Endpoint 5
#define USB_O_TXFUNCADDR6       0x000000B0U  // USB Transmit Functional Address
                                             // Endpoint 6
#define USB_O_TXHUBADDR6        0x000000B2U  // USB Transmit Hub Address
                                             // Endpoint 6
#define USB_O_TXHUBPORT6        0x000000B3U  // USB Transmit Hub Port Endpoint 6
#define USB_O_RXFUNCADDR6       0x000000B4U  // USB Receive Functional Address
                                             // Endpoint 6
#define USB_O_RXHUBADDR6        0x000000B6U  // USB Receive Hub Address Endpoint
                                             // 6
#define USB_O_RXHUBPORT6        0x000000B7U  // USB Receive Hub Port Endpoint 6
#define USB_O_TXFUNCADDR7       0x000000B8U  // USB Transmit Functional Address
                                             // Endpoint 7
#define USB_O_TXHUBADDR7        0x000000BAU  // USB Transmit Hub Address
                                             // Endpoint 7
#define USB_O_TXHUBPORT7        0x000000BBU  // USB Transmit Hub Port Endpoint 7
#define USB_O_RXFUNCADDR7       0x000000BCU  // USB Receive Functional Address
                                             // Endpoint 7
#define USB_O_RXHUBADDR7        0x000000BEU  // USB Receive Hub Address Endpoint
                                             // 7
#define USB_O_RXHUBPORT7        0x000000BFU  // USB Receive Hub Port Endpoint 7
#define USB_O_TXFUNCADDR8       0x000000C0U  // USB Transmit Functional Address
                                             // Endpoint 8
#define USB_O_TXHUBADDR8        0x000000C2U  // USB Transmit Hub Address
                                             // Endpoint 8
#define USB_O_TXHUBPORT8        0x000000C3U  // USB Transmit Hub Port Endpoint 8
#define USB_O_RXFUNCADDR8       0x000000C4U  // USB Receive Functional Address
                                             // Endpoint 8
#define USB_O_RXHUBADDR8        0x000000C6U  // USB Receive Hub Address Endpoint
                                             // 8
#define USB_O_RXHUBPORT8        0x000000C7U  // USB Receive Hub Port Endpoint 8
#define USB_O_TXFUNCADDR9       0x000000C8U  // USB Transmit Functional Address
                                             // Endpoint 9
#define USB_O_TXHUBADDR9        0x000000CAU  // USB Transmit Hub Address
                                             // Endpoint 9
#define USB_O_TXHUBPORT9        0x000000CBU  // USB Transmit Hub Port Endpoint 9
#define USB_O_RXFUNCADDR9       0x000000CCU  // USB Receive Functional Address
                                             // Endpoint 9
#define USB_O_RXHUBADDR9        0x000000CEU  // USB Receive Hub Address Endpoint
                                             // 9
#define USB_O_RXHUBPORT9        0x000000CFU  // USB Receive Hub Port Endpoint 9
#define USB_O_TXFUNCADDR10      0x000000D0U  // USB Transmit Functional Address
                                             // Endpoint 10
#define USB_O_TXHUBADDR10       0x000000D2U  // USB Transmit Hub Address
                                             // Endpoint 10
#define USB_O_TXHUBPORT10       0x000000D3U  // USB Transmit Hub Port Endpoint
                                             // 10
#define USB_O_RXFUNCADDR10      0x000000D4U  // USB Receive Functional Address
                                             // Endpoint 10
#define USB_O_RXHUBADDR10       0x000000D6U  // USB Receive Hub Address Endpoint
                                             // 10
#define USB_O_RXHUBPORT10       0x000000D7U  // USB Receive Hub Port Endpoint 10
#define USB_O_TXFUNCADDR11      0x000000D8U  // USB Transmit Functional Address
                                             // Endpoint 11
#define USB_O_TXHUBADDR11       0x000000DAU  // USB Transmit Hub Address
                                             // Endpoint 11
#define USB_O_TXHUBPORT11       0x000000DBU  // USB Transmit Hub Port Endpoint
                                             // 11
#define USB_O_RXFUNCADDR11      0x000000DCU  // USB Receive Functional Address
                                             // Endpoint 11
#define USB_O_RXHUBADDR11       0x000000DEU  // USB Receive Hub Address Endpoint
                                             // 11
#define USB_O_RXHUBPORT11       0x000000DFU  // USB Receive Hub Port Endpoint 11
#define USB_O_TXFUNCADDR12      0x000000E0U  // USB Transmit Functional Address
                                             // Endpoint 12
#define USB_O_TXHUBADDR12       0x000000E2U  // USB Transmit Hub Address
                                             // Endpoint 12
#define USB_O_TXHUBPORT12       0x000000E3U  // USB Transmit Hub Port Endpoint
                                             // 12
#define USB_O_RXFUNCADDR12      0x000000E4U  // USB Receive Functional Address
                                             // Endpoint 12
#define USB_O_RXHUBADDR12       0x000000E6U  // USB Receive Hub Address Endpoint
                                             // 12
#define USB_O_RXHUBPORT12       0x000000E7U  // USB Receive Hub Port Endpoint 12
#define USB_O_TXFUNCADDR13      0x000000E8U  // USB Transmit Functional Address
                                             // Endpoint 13
#define USB_O_TXHUBADDR13       0x000000EAU  // USB Transmit Hub Address
                                             // Endpoint 13
#define USB_O_TXHUBPORT13       0x000000EBU  // USB Transmit Hub Port Endpoint
                                             // 13
#define USB_O_RXFUNCADDR13      0x000000ECU  // USB Receive Functional Address
                                             // Endpoint 13
#define USB_O_RXHUBADDR13       0x000000EEU  // USB Receive Hub Address Endpoint
                                             // 13
#define USB_O_RXHUBPORT13       0x000000EFU  // USB Receive Hub Port Endpoint 13
#define USB_O_TXFUNCADDR14      0x000000F0U  // USB Transmit Functional Address
                                             // Endpoint 14
#define USB_O_TXHUBADDR14       0x000000F2U  // USB Transmit Hub Address
                                             // Endpoint 14
#define USB_O_TXHUBPORT14       0x000000F3U  // USB Transmit Hub Port Endpoint
                                             // 14
#define USB_O_RXFUNCADDR14      0x000000F4U  // USB Receive Functional Address
                                             // Endpoint 14
#define USB_O_RXHUBADDR14       0x000000F6U  // USB Receive Hub Address Endpoint
                                             // 14
#define USB_O_RXHUBPORT14       0x000000F7U  // USB Receive Hub Port Endpoint 14
#define USB_O_TXFUNCADDR15      0x000000F8U  // USB Transmit Functional Address
                                             // Endpoint 15
#define USB_O_TXHUBADDR15       0x000000FAU  // USB Transmit Hub Address
                                             // Endpoint 15
#define USB_O_TXHUBPORT15       0x000000FBU  // USB Transmit Hub Port Endpoint
                                             // 15
#define USB_O_RXFUNCADDR15      0x000000FCU  // USB Receive Functional Address
                                             // Endpoint 15
#define USB_O_RXHUBADDR15       0x000000FEU  // USB Receive Hub Address Endpoint
                                             // 15
#define USB_O_RXHUBPORT15       0x000000FFU  // USB Receive Hub Port Endpoint 15
#define USB_O_CSRL0             0x00000102U  // USB Control and Status Endpoint
                                             // 0 Low
#define USB_O_CSRH0             0x00000103U  // USB Control and Status Endpoint
                                             // 0 High
#define USB_O_COUNT0            0x00000108U  // USB Receive Byte Count Endpoint
                                             // 0
#define USB_O_TYPE0             0x0000010AU  // USB Type Endpoint 0
#define USB_O_NAKLMT            0x0000010BU  // USB NAK Limit
#define USB_O_TXMAXP1           0x00000110U  // USB Maximum Transmit Data
                                             // Endpoint 1
#define USB_O_TXCSRL1           0x00000112U  // USB Transmit Control and Status
                                             // Endpoint 1 Low
#define USB_O_TXCSRH1           0x00000113U  // USB Transmit Control and Status
                                             // Endpoint 1 High
#define USB_O_RXMAXP1           0x00000114U  // USB Maximum Receive Data
                                             // Endpoint 1
#define USB_O_RXCSRL1           0x00000116U  // USB Receive Control and Status
                                             // Endpoint 1 Low
#define USB_O_RXCSRH1           0x00000117U  // USB Receive Control and Status
                                             // Endpoint 1 High
#define USB_O_RXCOUNT1          0x00000118U  // USB Receive Byte Count Endpoint
                                             // 1
#define USB_O_TXTYPE1           0x0000011AU  // USB Host Transmit Configure Type
                                             // Endpoint 1
#define USB_O_TXINTERVAL1       0x0000011BU  // USB Host Transmit Interval
                                             // Endpoint 1
#define USB_O_RXTYPE1           0x0000011CU  // USB Host Configure Receive Type
                                             // Endpoint 1
#define USB_O_RXINTERVAL1       0x0000011DU  // USB Host Receive Polling
                                             // Interval Endpoint 1
#define USB_O_TXMAXP2           0x00000120U  // USB Maximum Transmit Data
                                             // Endpoint 2
#define USB_O_TXCSRL2           0x00000122U  // USB Transmit Control and Status
                                             // Endpoint 2 Low
#define USB_O_TXCSRH2           0x00000123U  // USB Transmit Control and Status
                                             // Endpoint 2 High
#define USB_O_RXMAXP2           0x00000124U  // USB Maximum Receive Data
                                             // Endpoint 2
#define USB_O_RXCSRL2           0x00000126U  // USB Receive Control and Status
                                             // Endpoint 2 Low
#define USB_O_RXCSRH2           0x00000127U  // USB Receive Control and Status
                                             // Endpoint 2 High
#define USB_O_RXCOUNT2          0x00000128U  // USB Receive Byte Count Endpoint
                                             // 2
#define USB_O_TXTYPE2           0x0000012AU  // USB Host Transmit Configure Type
                                             // Endpoint 2
#define USB_O_TXINTERVAL2       0x0000012BU  // USB Host Transmit Interval
                                             // Endpoint 2
#define USB_O_RXTYPE2           0x0000012CU  // USB Host Configure Receive Type
                                             // Endpoint 2
#define USB_O_RXINTERVAL2       0x0000012DU  // USB Host Receive Polling
                                             // Interval Endpoint 2
#define USB_O_TXMAXP3           0x00000130U  // USB Maximum Transmit Data
                                             // Endpoint 3
#define USB_O_TXCSRL3           0x00000132U  // USB Transmit Control and Status
                                             // Endpoint 3 Low
#define USB_O_TXCSRH3           0x00000133U  // USB Transmit Control and Status
                                             // Endpoint 3 High
#define USB_O_RXMAXP3           0x00000134U  // USB Maximum Receive Data
                                             // Endpoint 3
#define USB_O_RXCSRL3           0x00000136U  // USB Receive Control and Status
                                             // Endpoint 3 Low
#define USB_O_RXCSRH3           0x00000137U  // USB Receive Control and Status
                                             // Endpoint 3 High
#define USB_O_RXCOUNT3          0x00000138U  // USB Receive Byte Count Endpoint
                                             // 3
#define USB_O_TXTYPE3           0x0000013AU  // USB Host Transmit Configure Type
                                             // Endpoint 3
#define USB_O_TXINTERVAL3       0x0000013BU  // USB Host Transmit Interval
                                             // Endpoint 3
#define USB_O_RXTYPE3           0x0000013CU  // USB Host Configure Receive Type
                                             // Endpoint 3
#define USB_O_RXINTERVAL3       0x0000013DU  // USB Host Receive Polling
                                             // Interval Endpoint 3
#define USB_O_TXMAXP4           0x00000140U  // USB Maximum Transmit Data
                                             // Endpoint 4
#define USB_O_TXCSRL4           0x00000142U  // USB Transmit Control and Status
                                             // Endpoint 4 Low
#define USB_O_TXCSRH4           0x00000143U  // USB Transmit Control and Status
                                             // Endpoint 4 High
#define USB_O_RXMAXP4           0x00000144U  // USB Maximum Receive Data
                                             // Endpoint 4
#define USB_O_RXCSRL4           0x00000146U  // USB Receive Control and Status
                                             // Endpoint 4 Low
#define USB_O_RXCSRH4           0x00000147U  // USB Receive Control and Status
                                             // Endpoint 4 High
#define USB_O_RXCOUNT4          0x00000148U  // USB Receive Byte Count Endpoint
                                             // 4
#define USB_O_TXTYPE4           0x0000014AU  // USB Host Transmit Configure Type
                                             // Endpoint 4
#define USB_O_TXINTERVAL4       0x0000014BU  // USB Host Transmit Interval
                                             // Endpoint 4
#define USB_O_RXTYPE4           0x0000014CU  // USB Host Configure Receive Type
                                             // Endpoint 4
#define USB_O_RXINTERVAL4       0x0000014DU  // USB Host Receive Polling
                                             // Interval Endpoint 4
#define USB_O_TXMAXP5           0x00000150U  // USB Maximum Transmit Data
                                             // Endpoint 5
#define USB_O_TXCSRL5           0x00000152U  // USB Transmit Control and Status
                                             // Endpoint 5 Low
#define USB_O_TXCSRH5           0x00000153U  // USB Transmit Control and Status
                                             // Endpoint 5 High
#define USB_O_RXMAXP5           0x00000154U  // USB Maximum Receive Data
                                             // Endpoint 5
#define USB_O_RXCSRL5           0x00000156U  // USB Receive Control and Status
                                             // Endpoint 5 Low
#define USB_O_RXCSRH5           0x00000157U  // USB Receive Control and Status
                                             // Endpoint 5 High
