t0biasm/embedded-project/platforms/c2000/mcal/f28p65/code/inc/hw_usb.h
#define USB_O_RXCOUNT5          0x00000158U  // USB Receive Byte Count Endpoint
                                             // 5
#define USB_O_TXTYPE5           0x0000015AU  // USB Host Transmit Configure Type
                                             // Endpoint 5
#define USB_O_TXINTERVAL5       0x0000015BU  // USB Host Transmit Interval
                                             // Endpoint 5
#define USB_O_RXTYPE5           0x0000015CU  // USB Host Configure Receive Type
                                             // Endpoint 5
#define USB_O_RXINTERVAL5       0x0000015DU  // USB Host Receive Polling
                                             // Interval Endpoint 5
#define USB_O_TXMAXP6           0x00000160U  // USB Maximum Transmit Data
                                             // Endpoint 6
#define USB_O_TXCSRL6           0x00000162U  // USB Transmit Control and Status
                                             // Endpoint 6 Low
#define USB_O_TXCSRH6           0x00000163U  // USB Transmit Control and Status
                                             // Endpoint 6 High
#define USB_O_RXMAXP6           0x00000164U  // USB Maximum Receive Data
                                             // Endpoint 6
#define USB_O_RXCSRL6           0x00000166U  // USB Receive Control and Status
                                             // Endpoint 6 Low
#define USB_O_RXCSRH6           0x00000167U  // USB Receive Control and Status
                                             // Endpoint 6 High
#define USB_O_RXCOUNT6          0x00000168U  // USB Receive Byte Count Endpoint
                                             // 6
#define USB_O_TXTYPE6           0x0000016AU  // USB Host Transmit Configure Type
                                             // Endpoint 6
#define USB_O_TXINTERVAL6       0x0000016BU  // USB Host Transmit Interval
                                             // Endpoint 6
#define USB_O_RXTYPE6           0x0000016CU  // USB Host Configure Receive Type
                                             // Endpoint 6
#define USB_O_RXINTERVAL6       0x0000016DU  // USB Host Receive Polling
                                             // Interval Endpoint 6
#define USB_O_TXMAXP7           0x00000170U  // USB Maximum Transmit Data
                                             // Endpoint 7
#define USB_O_TXCSRL7           0x00000172U  // USB Transmit Control and Status
                                             // Endpoint 7 Low
#define USB_O_TXCSRH7           0x00000173U  // USB Transmit Control and Status
                                             // Endpoint 7 High
#define USB_O_RXMAXP7           0x00000174U  // USB Maximum Receive Data
                                             // Endpoint 7
#define USB_O_RXCSRL7           0x00000176U  // USB Receive Control and Status
                                             // Endpoint 7 Low
#define USB_O_RXCSRH7           0x00000177U  // USB Receive Control and Status
                                             // Endpoint 7 High
#define USB_O_RXCOUNT7          0x00000178U  // USB Receive Byte Count Endpoint
                                             // 7
#define USB_O_TXTYPE7           0x0000017AU  // USB Host Transmit Configure Type
                                             // Endpoint 7
#define USB_O_TXINTERVAL7       0x0000017BU  // USB Host Transmit Interval
                                             // Endpoint 7
#define USB_O_RXTYPE7           0x0000017CU  // USB Host Configure Receive Type
                                             // Endpoint 7
#define USB_O_RXINTERVAL7       0x0000017DU  // USB Host Receive Polling
                                             // Interval Endpoint 7
#define USB_O_TXMAXP8           0x00000180U  // USB Maximum Transmit Data
                                             // Endpoint 8
#define USB_O_TXCSRL8           0x00000182U  // USB Transmit Control and Status
                                             // Endpoint 8 Low
#define USB_O_TXCSRH8           0x00000183U  // USB Transmit Control and Status
                                             // Endpoint 8 High
#define USB_O_RXMAXP8           0x00000184U  // USB Maximum Receive Data
                                             // Endpoint 8
#define USB_O_RXCSRL8           0x00000186U  // USB Receive Control and Status
                                             // Endpoint 8 Low
#define USB_O_RXCSRH8           0x00000187U  // USB Receive Control and Status
                                             // Endpoint 8 High
#define USB_O_RXCOUNT8          0x00000188U  // USB Receive Byte Count Endpoint
                                             // 8
#define USB_O_TXTYPE8           0x0000018AU  // USB Host Transmit Configure Type
                                             // Endpoint 8
#define USB_O_TXINTERVAL8       0x0000018BU  // USB Host Transmit Interval
                                             // Endpoint 8
#define USB_O_RXTYPE8           0x0000018CU  // USB Host Configure Receive Type
                                             // Endpoint 8
#define USB_O_RXINTERVAL8       0x0000018DU  // USB Host Receive Polling
                                             // Interval Endpoint 8
#define USB_O_TXMAXP9           0x00000190U  // USB Maximum Transmit Data
                                             // Endpoint 9
#define USB_O_TXCSRL9           0x00000192U  // USB Transmit Control and Status
                                             // Endpoint 9 Low
#define USB_O_TXCSRH9           0x00000193U  // USB Transmit Control and Status
                                             // Endpoint 9 High
#define USB_O_RXMAXP9           0x00000194U  // USB Maximum Receive Data
                                             // Endpoint 9
#define USB_O_RXCSRL9           0x00000196U  // USB Receive Control and Status
                                             // Endpoint 9 Low
#define USB_O_RXCSRH9           0x00000197U  // USB Receive Control and Status
                                             // Endpoint 9 High
#define USB_O_RXCOUNT9          0x00000198U  // USB Receive Byte Count Endpoint
                                             // 9
#define USB_O_TXTYPE9           0x0000019AU  // USB Host Transmit Configure Type
                                             // Endpoint 9
#define USB_O_TXINTERVAL9       0x0000019BU  // USB Host Transmit Interval
                                             // Endpoint 9
#define USB_O_RXTYPE9           0x0000019CU  // USB Host Configure Receive Type
                                             // Endpoint 9
#define USB_O_RXINTERVAL9       0x0000019DU  // USB Host Receive Polling
                                             // Interval Endpoint 9
#define USB_O_TXMAXP10          0x000001A0U  // USB Maximum Transmit Data
                                             // Endpoint 10
#define USB_O_TXCSRL10          0x000001A2U  // USB Transmit Control and Status
                                             // Endpoint 10 Low
#define USB_O_TXCSRH10          0x000001A3U  // USB Transmit Control and Status
                                             // Endpoint 10 High
#define USB_O_RXMAXP10          0x000001A4U  // USB Maximum Receive Data
                                             // Endpoint 10
#define USB_O_RXCSRL10          0x000001A6U  // USB Receive Control and Status
                                             // Endpoint 10 Low
#define USB_O_RXCSRH10          0x000001A7U  // USB Receive Control and Status
                                             // Endpoint 10 High
#define USB_O_RXCOUNT10         0x000001A8U  // USB Receive Byte Count Endpoint
                                             // 10
#define USB_O_TXTYPE10          0x000001AAU  // USB Host Transmit Configure Type
                                             // Endpoint 10
#define USB_O_TXINTERVAL10      0x000001ABU  // USB Host Transmit Interval
                                             // Endpoint 10
#define USB_O_RXTYPE10          0x000001ACU  // USB Host Configure Receive Type
                                             // Endpoint 10
#define USB_O_RXINTERVAL10      0x000001ADU  // USB Host Receive Polling
                                             // Interval Endpoint 10
#define USB_O_TXMAXP11          0x000001B0U  // USB Maximum Transmit Data
                                             // Endpoint 11
#define USB_O_TXCSRL11          0x000001B2U  // USB Transmit Control and Status
                                             // Endpoint 11 Low
#define USB_O_TXCSRH11          0x000001B3U  // USB Transmit Control and Status
                                             // Endpoint 11 High
#define USB_O_RXMAXP11          0x000001B4U  // USB Maximum Receive Data
                                             // Endpoint 11
#define USB_O_RXCSRL11          0x000001B6U  // USB Receive Control and Status
                                             // Endpoint 11 Low
#define USB_O_RXCSRH11          0x000001B7U  // USB Receive Control and Status
                                             // Endpoint 11 High
#define USB_O_RXCOUNT11         0x000001B8U  // USB Receive Byte Count Endpoint
                                             // 11
#define USB_O_TXTYPE11          0x000001BAU  // USB Host Transmit Configure Type
                                             // Endpoint 11
#define USB_O_TXINTERVAL11      0x000001BBU  // USB Host Transmit Interval
                                             // Endpoint 11
#define USB_O_RXTYPE11          0x000001BCU  // USB Host Configure Receive Type
                                             // Endpoint 11
#define USB_O_RXINTERVAL11      0x000001BDU  // USB Host Receive Polling
                                             // Interval Endpoint 11
#define USB_O_TXMAXP12          0x000001C0U  // USB Maximum Transmit Data
                                             // Endpoint 12
#define USB_O_TXCSRL12          0x000001C2U  // USB Transmit Control and Status
                                             // Endpoint 12 Low
#define USB_O_TXCSRH12          0x000001C3U  // USB Transmit Control and Status
                                             // Endpoint 12 High
#define USB_O_RXMAXP12          0x000001C4U  // USB Maximum Receive Data
                                             // Endpoint 12
#define USB_O_RXCSRL12          0x000001C6U  // USB Receive Control and Status
                                             // Endpoint 12 Low
#define USB_O_RXCSRH12          0x000001C7U  // USB Receive Control and Status
                                             // Endpoint 12 High
#define USB_O_RXCOUNT12         0x000001C8U  // USB Receive Byte Count Endpoint
                                             // 12
#define USB_O_TXTYPE12          0x000001CAU  // USB Host Transmit Configure Type
                                             // Endpoint 12
#define USB_O_TXINTERVAL12      0x000001CBU  // USB Host Transmit Interval
                                             // Endpoint 12
#define USB_O_RXTYPE12          0x000001CCU  // USB Host Configure Receive Type
                                             // Endpoint 12
#define USB_O_RXINTERVAL12      0x000001CDU  // USB Host Receive Polling
                                             // Interval Endpoint 12
#define USB_O_TXMAXP13          0x000001D0U  // USB Maximum Transmit Data
                                             // Endpoint 13
#define USB_O_TXCSRL13          0x000001D2U  // USB Transmit Control and Status
                                             // Endpoint 13 Low
#define USB_O_TXCSRH13          0x000001D3U  // USB Transmit Control and Status
                                             // Endpoint 13 High
#define USB_O_RXMAXP13          0x000001D4U  // USB Maximum Receive Data
                                             // Endpoint 13
#define USB_O_RXCSRL13          0x000001D6U  // USB Receive Control and Status
                                             // Endpoint 13 Low
#define USB_O_RXCSRH13          0x000001D7U  // USB Receive Control and Status
                                             // Endpoint 13 High
#define USB_O_RXCOUNT13         0x000001D8U  // USB Receive Byte Count Endpoint
                                             // 13
#define USB_O_TXTYPE13          0x000001DAU  // USB Host Transmit Configure Type
                                             // Endpoint 13
#define USB_O_TXINTERVAL13      0x000001DBU  // USB Host Transmit Interval
                                             // Endpoint 13
#define USB_O_RXTYPE13          0x000001DCU  // USB Host Configure Receive Type
                                             // Endpoint 13
#define USB_O_RXINTERVAL13      0x000001DDU  // USB Host Receive Polling
                                             // Interval Endpoint 13
#define USB_O_TXMAXP14          0x000001E0U  // USB Maximum Transmit Data
                                             // Endpoint 14
#define USB_O_TXCSRL14          0x000001E2U  // USB Transmit Control and Status
                                             // Endpoint 14 Low
#define USB_O_TXCSRH14          0x000001E3U  // USB Transmit Control and Status
                                             // Endpoint 14 High
#define USB_O_RXMAXP14          0x000001E4U  // USB Maximum Receive Data
                                             // Endpoint 14
#define USB_O_RXCSRL14          0x000001E6U  // USB Receive Control and Status
                                             // Endpoint 14 Low
#define USB_O_RXCSRH14          0x000001E7U  // USB Receive Control and Status
                                             // Endpoint 14 High
#define USB_O_RXCOUNT14         0x000001E8U  // USB Receive Byte Count Endpoint
                                             // 14
#define USB_O_TXTYPE14          0x000001EAU  // USB Host Transmit Configure Type
                                             // Endpoint 14
#define USB_O_TXINTERVAL14      0x000001EBU  // USB Host Transmit Interval
                                             // Endpoint 14
#define USB_O_RXTYPE14          0x000001ECU  // USB Host Configure Receive Type
                                             // Endpoint 14
#define USB_O_RXINTERVAL14      0x000001EDU  // USB Host Receive Polling
                                             // Interval Endpoint 14
#define USB_O_TXMAXP15          0x000001F0U  // USB Maximum Transmit Data
                                             // Endpoint 15
#define USB_O_TXCSRL15          0x000001F2U  // USB Transmit Control and Status
                                             // Endpoint 15 Low
#define USB_O_TXCSRH15          0x000001F3U  // USB Transmit Control and Status
                                             // Endpoint 15 High
#define USB_O_RXMAXP15          0x000001F4U  // USB Maximum Receive Data
                                             // Endpoint 15
#define USB_O_RXCSRL15          0x000001F6U  // USB Receive Control and Status
                                             // Endpoint 15 Low
#define USB_O_RXCSRH15          0x000001F7U  // USB Receive Control and Status
                                             // Endpoint 15 High
#define USB_O_RXCOUNT15         0x000001F8U  // USB Receive Byte Count Endpoint
                                             // 15
#define USB_O_TXTYPE15          0x000001FAU  // USB Host Transmit Configure Type
                                             // Endpoint 15
#define USB_O_TXINTERVAL15      0x000001FBU  // USB Host Transmit Interval
                                             // Endpoint 15
#define USB_O_RXTYPE15          0x000001FCU  // USB Host Configure Receive Type
                                             // Endpoint 15
#define USB_O_RXINTERVAL15      0x000001FDU  // USB Host Receive Polling
                                             // Interval Endpoint 15
#define USB_O_RQPKTCOUNT1       0x00000304U  // USB Request Packet Count in
                                             // Block Transfer Endpoint 1
#define USB_O_RQPKTCOUNT2       0x00000308U  // USB Request Packet Count in
                                             // Block Transfer Endpoint 2
#define USB_O_RQPKTCOUNT3       0x0000030CU  // USB Request Packet Count in
                                             // Block Transfer Endpoint 3
#define USB_O_RQPKTCOUNT4       0x00000310U  // USB Request Packet Count in
                                             // Block Transfer Endpoint 4
#define USB_O_RQPKTCOUNT5       0x00000314U  // USB Request Packet Count in
                                             // Block Transfer Endpoint 5
#define USB_O_RQPKTCOUNT6       0x00000318U  // USB Request Packet Count in
                                             // Block Transfer Endpoint 6
#define USB_O_RQPKTCOUNT7       0x0000031CU  // USB Request Packet Count in
                                             // Block Transfer Endpoint 7
#define USB_O_RQPKTCOUNT8       0x00000320U  // USB Request Packet Count in
                                             // Block Transfer Endpoint 8
#define USB_O_RQPKTCOUNT9       0x00000324U  // USB Request Packet Count in
                                             // Block Transfer Endpoint 9
#define USB_O_RQPKTCOUNT10      0x00000328U  // USB Request Packet Count in
                                             // Block Transfer Endpoint 10
#define USB_O_RQPKTCOUNT11      0x0000032CU  // USB Request Packet Count in
                                             // Block Transfer Endpoint 11
#define USB_O_RQPKTCOUNT12      0x00000330U  // USB Request Packet Count in
                                             // Block Transfer Endpoint 12
#define USB_O_RQPKTCOUNT13      0x00000334U  // USB Request Packet Count in
                                             // Block Transfer Endpoint 13
#define USB_O_RQPKTCOUNT14      0x00000338U  // USB Request Packet Count in
                                             // Block Transfer Endpoint 14
#define USB_O_RQPKTCOUNT15      0x0000033CU  // USB Request Packet Count in
                                             // Block Transfer Endpoint 15
#define USB_O_RXDPKTBUFDIS      0x00000340U  // USB Receive Double Packet Buffer
                                             // Disable
#define USB_O_TXDPKTBUFDIS      0x00000342U  // USB Transmit Double Packet
                                             // Buffer Disable
#define USB_O_EPC               0x00000400U  // USB External Power Control
#define USB_O_EPCRIS            0x00000404U  // USB External Power Control Raw
                                             // Interrupt Status
#define USB_O_EPCIM             0x00000408U  // USB External Power Control
                                             // Interrupt Mask
#define USB_O_EPCISC            0x0000040CU  // USB External Power Control
                                             // Interrupt Status and Clear
#define USB_O_DRRIS             0x00000410U  // USB Device RESUME Raw Interrupt
                                             // Status
#define USB_O_DRIM              0x00000414U  // USB Device RESUME Interrupt Mask
#define USB_O_DRISC             0x00000418U  // USB Device RESUME Interrupt
                                             // Status and Clear
#define USB_O_GPCS              0x0000041CU  // USB General-Purpose Control and
                                             // Status
#define USB_O_VDC               0x00000430U  // USB VBUS Droop Control
#define USB_O_VDCRIS            0x00000434U  // USB VBUS Droop Control Raw
                                             // Interrupt Status
#define USB_O_VDCIM             0x00000438U  // USB VBUS Droop Control Interrupt
                                             // Mask
#define USB_O_VDCISC            0x0000043CU  // USB VBUS Droop Control Interrupt
                                             // Status and Clear
#define USB_O_IDVRIS            0x00000444U  // USB ID Valid Detect Raw
                                             // Interrupt Status
#define USB_O_IDVIM             0x00000448U  // USB ID Valid Detect Interrupt
                                             // Mask
#define USB_O_IDVISC            0x0000044CU  // USB ID Valid Detect Interrupt
                                             // Status and Clear
#define USB_O_DMASEL            0x00000450U  // USB DMA Select
#define USB_O_GLBINTEN          0x00000480U   // USB Global Interrupt Enable
                                             // Register
#define USB_O_GLBINTFLG         0x00000484U  // USB Global Interrupt Flag
                                             // Register
#define USB_O_GLBINTFLGCL       0x00000488U  // USB Global Interrupt Flag
                                             // Clear Register
#define USB_O_PP                0x00000FC0U  // USB Peripheral Properties

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_FADDR register.
//
//*****************************************************************************
#define USB_FADDR_M             0x0000007FU  // Function Address
#define USB_FADDR_S             0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_POWER register.
//
//*****************************************************************************
#define USB_POWER_ISOUP         0x00000080U  // Isochronous Update
#define USB_POWER_SOFTCONN      0x00000040U  // Soft Connect/Disconnect
#define USB_POWER_RESET         0x00000008U  // RESET Signaling
#define USB_POWER_RESUME        0x00000004U  // RESUME Signaling
#define USB_POWER_SUSPEND       0x00000002U  // SUSPEND Mode
#define USB_POWER_PWRDNPHY      0x00000001U  // Power Down PHY

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXIS register.
//
//*****************************************************************************
#define USB_TXIS_EP15           0x00008000U  // TX Endpoint 15 Interrupt
#define USB_TXIS_EP14           0x00004000U  // TX Endpoint 14 Interrupt
#define USB_TXIS_EP13           0x00002000U  // TX Endpoint 13 Interrupt
#define USB_TXIS_EP12           0x00001000U  // TX Endpoint 12 Interrupt
#define USB_TXIS_EP11           0x00000800U  // TX Endpoint 11 Interrupt
#define USB_TXIS_EP10           0x00000400U  // TX Endpoint 10 Interrupt
#define USB_TXIS_EP9            0x00000200U  // TX Endpoint 9 Interrupt
#define USB_TXIS_EP8            0x00000100U  // TX Endpoint 8 Interrupt
#define USB_TXIS_EP7            0x00000080U  // TX Endpoint 7 Interrupt
#define USB_TXIS_EP6            0x00000040U  // TX Endpoint 6 Interrupt
#define USB_TXIS_EP5            0x00000020U  // TX Endpoint 5 Interrupt
#define USB_TXIS_EP4            0x00000010U  // TX Endpoint 4 Interrupt
#define USB_TXIS_EP3            0x00000008U  // TX Endpoint 3 Interrupt
#define USB_TXIS_EP2            0x00000004U  // TX Endpoint 2 Interrupt
#define USB_TXIS_EP1            0x00000002U  // TX Endpoint 1 Interrupt
#define USB_TXIS_EP0            0x00000001U  // TX and RX Endpoint 0 Interrupt

